ETL/Catalogs/КлючевыеПоказателиДеятельности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>КлючевыеПоказателиДеятельности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияKPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесНаправленияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БизнесНаправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БизнесНаправление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесНаправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесНаправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесНаправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриториальноеРасположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриториальноеРасположение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субхолдинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субхолдинги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/CommonModules/КлючевыеПоказателиВызовСервера/Ext/Module.bsl
Процедура ПриСозданииНаСервереKPI(Форма,Объект,Отказ, СтандартнаяОбработка) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючевыеПоказателиДеятельностиБизнесНаправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ОТбор
		|ИЗ
		|	Справочник.КлючевыеПоказателиДеятельности.БизнесНаправления КАК КлючевыеПоказателиДеятельностиБизнесНаправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КлючевыеПоказателиДеятельностиБизнесНаправления.БизнесНаправление = Организации.БизнесНаправление
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	КлючевыеПоказателиДеятельностиБизнесНаправления.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеПоказателиДеятельности.Ссылка КАК КлючевойПоказатель,
		|	КлючевыеПоказателиДеятельности.Наименование КАК Наименование,
		|	КлючевыеПоказателиДеятельности.КодСправочника КАК Код
		|ИЗ
		|	ВТ_ОТбор КАК ВТ_ОТбор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоказателиДеятельности КАК КлючевыеПоказателиДеятельности
		|		ПО ВТ_ОТбор.Ссылка = КлючевыеПоказателиДеятельности.Ссылка
		|ГДЕ
		|	КлючевыеПоказателиДеятельности.Родитель = ЗНАЧЕНИЕ(Справочник.КлючевыеПоказателиДеятельности.ПустаяССылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	КлючевыеПоказателиДеятельности.Ссылка,
		|	КлючевыеПоказателиДеятельности.Наименование,
		|	КлючевыеПоказателиДеятельности.КодСправочника";
	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Выборка = Справочники.КлючевыеПоказателиДеятельности.Выбрать(ВыборкаДетальныеЗаписи.КлючевойПоказатель);
		Если Не Выборка.Следующий() Тогда
			Продолжить;
		КонецЕсли;
		
		
		СтрокаТаблицы = Форма.ТаблицаСтраницKPI.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы,ВыборкаДетальныеЗаписи);
		Позиция = Найти(ВыборкаДетальныеЗаписи.Код,".");
		СтрокаТаблицы.ИмяГруппы = СокрЛП(Лев(ВыборкаДетальныеЗаписи.Код,Позиция-1))+"v2";
		
	КонецЦикла; 
	
	Если  НЕ Форма.ТаблицаСтраницKPI.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Каждого СтрокаТаблицы Из Форма.ТаблицаСтраницKPI Цикл  
		
			НовыйЭлементГруппа = Форма.Элементы.Добавить("ГруппаДляОтбора"+СтрокаТаблицы.ИмяГруппы,Тип("ГруппаФормы"),Форма.Элементы.СтраницыГруппыKPI);
			НовыйЭлементГруппа.Вид = ВидГруппыФормы.Страница;
			НовыйЭлементГруппа.Заголовок = СтрокаТаблицы.Наименование;
	
	
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Форма.ТаблицаСтраницKPI Цикл  
		
		Реквизиты = Новый Массив;
		Дерево = Новый РеквизитФормы("Дерево" + СтрокаТаблицы.ИмяГруппы,Новый ОписаниеТипов("ДеревоЗначений"));
		Реквизиты.Добавить(Дерево);
		
		РеквизитКод = Новый РеквизитФормы("Код",Новый ОписаниеТипов("Строка"),"Дерево" + СтрокаТаблицы.ИмяГруппы);
		Реквизиты.Добавить(РеквизитКод);
		
		РеквизитПоказатель = Новый РеквизитФормы("КлючевойПоказатель",Новый ОписаниеТипов("СправочникСсылка.КлючевыеПоказателиДеятельности"),"Дерево" + СтрокаТаблицы.ИмяГруппы);
		Реквизиты.Добавить(РеквизитПоказатель);
		
		
		РеквизитЕдиницаИзмерения = Новый РеквизитФормы("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмеренияKPI"),"Дерево" + СтрокаТаблицы.ИмяГруппы);
		Реквизиты.Добавить(РеквизитЕдиницаИзмерения);
		
		СтрокаМесяцев = "Январь,Февраль,Март,Апрель,Май,Июнь,Июль,Август,Сентябрь,Октябрь,Ноябрь,Декабрь";
		МассивМесяцев = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаМесяцев,",");
		Для Каждого Месяц Из МассивМесяцев Цикл
			
			Реквизиты.Добавить(Новый РеквизитФормы(Месяц,Новый ОписаниеТипов("Число"),"Дерево" + СтрокаТаблицы.ИмяГруппы));
			
		КонецЦикла;
			
		ТекущийГод = Новый РеквизитФормы("ТекущийГод",Новый ОписаниеТипов("Число"),"Дерево" + СтрокаТаблицы.ИмяГруппы);
		Реквизиты.Добавить(ТекущийГод); 
		
		ГодПлюс1 = Новый РеквизитФормы("ГодПлюс1",Новый ОписаниеТипов("Число"),"Дерево" + СтрокаТаблицы.ИмяГруппы);
		Реквизиты.Добавить(ГодПлюс1);
		
		ГодПлюс2 = Новый РеквизитФормы("ГодПлюс2",Новый ОписаниеТипов("Число"),"Дерево" + СтрокаТаблицы.ИмяГруппы);
		Реквизиты.Добавить(ГодПлюс2);
		
		ГодПлюс3 = Новый РеквизитФормы("ГодПлюс3",Новый ОписаниеТипов("Число"),"Дерево" + СтрокаТаблицы.ИмяГруппы);
		Реквизиты.Добавить(ГодПлюс3); 
		
		ГодПлюс4 = Новый РеквизитФормы("ГодПлюс4",Новый ОписаниеТипов("Число"),"Дерево" + СтрокаТаблицы.ИмяГруппы);
		Реквизиты.Добавить(ГодПлюс4);
		
		Форма.ИзменитьРеквизиты(Реквизиты);
		
		
		НовыйЭлемент = Форма.Элементы.Добавить("Дерево"+СтрокаТаблицы.ИмяГруппы,Тип("ТаблицаФормы"),Форма.Элементы["ГруппаДляОтбора"+СтрокаТаблицы.ИмяГруппы]);
		НовыйЭлемент.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы;
		НовыйЭлемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		//НовыйЭлемент.Высота = 20;
		
		
		НовыйЭлементКод = Форма.Элементы.Добавить("Код"+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
		НовыйЭлементКод.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +".Код";
		НовыйЭлементКод.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементКод.Ширина= 15;
		//
		НовыйЭлементКлючевойПоказатель = Форма.Элементы.Добавить("КлючевойПоказатель"+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
		НовыйЭлементКлючевойПоказатель.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +".КлючевойПоказатель";
		НовыйЭлементКлючевойПоказатель.Вид = ВидПоляФормы.ПолеВвода; 
		
		НовыйЭлементЕдиницаИзмерения = Форма.Элементы.Добавить("ЕдиницаИзмерения"+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
		НовыйЭлементЕдиницаИзмерения.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +".ЕдиницаИзмерения";
		НовыйЭлементЕдиницаИзмерения.Вид = ВидПоляФормы.ПолеВвода; 
		
		
		Для Каждого Месяц Из МассивМесяцев Цикл
			
			ЭлементМесяц = Форма.Элементы.Добавить(Месяц+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
			ЭлементМесяц.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +"."+Месяц;
			ЭлементМесяц.Вид = ВидПоляФормы.ПолеВвода; 
			
		КонецЦикла; 
		ПериодПланирования = КонецМесяца(ТекущаяДата());
		НовыйЭлементГТекущийГод = Форма.Элементы.Добавить("ТекущийГод"+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
		НовыйЭлементГТекущийГод.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +".ТекущийГод";
		НовыйЭлементГТекущийГод.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлементГТекущийГод.Заголовок = СтрЗаменить(СтрЗаменить(Строка(Год(ПериодПланирования)),Символ(150),""),",",""); 
		
		НовыйЭлементГодПлюс1 = Форма.Элементы.Добавить("ГодПлюс1"+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
		НовыйЭлементГодПлюс1.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +".ГодПлюс1";
		НовыйЭлементГодПлюс1.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлементГодПлюс1.Заголовок = СтрЗаменить(СтрЗаменить(Строка(Год(ПериодПланирования) +1),Символ(150),""),",","");  
		
		
		НовыйЭлементГодПлюс2 = Форма.Элементы.Добавить("ГодПлюс2"+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
		НовыйЭлементГодПлюс2.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +".ГодПлюс2";
		НовыйЭлементГодПлюс2.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлементГодПлюс2.Заголовок = СтрЗаменить(СтрЗаменить(Строка(Год(ПериодПланирования) +2),Символ(150),""),",","");  
		
		
		НовыйЭлементГодПлюс3 = Форма.Элементы.Добавить("ГодПлюс3"+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
		НовыйЭлементГодПлюс3.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +".ГодПлюс3";
		НовыйЭлементГодПлюс3.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлементГодПлюс3.Заголовок = СтрЗаменить(СтрЗаменить(Строка(Год(ПериодПланирования) +3),Символ(150),""),",",""); 
		
		НовыйЭлементГодПлюс4 = Форма.Элементы.Добавить("ГодПлюс4"+СтрокаТаблицы.ИмяГруппы,Тип("ПолеФормы"),НовыйЭлемент);
		НовыйЭлементГодПлюс4.ПутьКДанным = "Дерево" + СтрокаТаблицы.ИмяГруппы +".ГодПлюс4";
		НовыйЭлементГодПлюс4.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлементГодПлюс4.Заголовок = СтрЗаменить(СтрЗаменить(Строка(Год(ПериодПланирования) +4),Символ(150),""),",","");  
		
		
		
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючевыеПоказателиДеятельностиБизнесНаправления.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ОТбор
		|ИЗ
		|	Справочник.КлючевыеПоказателиДеятельности.БизнесНаправления КАК КлючевыеПоказателиДеятельностиБизнесНаправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КлючевыеПоказателиДеятельностиБизнесНаправления.БизнесНаправление = Организации.БизнесНаправление
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	КлючевыеПоказателиДеятельностиБизнесНаправления.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеПоказателиДеятельности.Код КАК Код,
		|	КлючевыеПоказателиДеятельности.Ссылка КАК КлючевойПоказатель,
		|	КлючевыеПоказателиДеятельности.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТ_ОТбор КАК ВТ_ОТбор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючевыеПоказателиДеятельности КАК КлючевыеПоказателиДеятельности
		|		ПО ВТ_ОТбор.Ссылка = КлючевыеПоказателиДеятельности.Ссылка
		|ГДЕ
		|	КлючевыеПоказателиДеятельности.Родитель В ИЕРАРХИИ(&Родитель)
		|
		|СГРУППИРОВАТЬ ПО
		|	КлючевыеПоказателиДеятельности.Ссылка,
		|	КлючевыеПоказателиДеятельности.Код,
		|	КлючевыеПоказателиДеятельности.ЕдиницаИзмерения
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлючевыеПоказателиДеятельности.Ссылка ИЕРАРХИЯ";
		
		Запрос.УстановитьПараметр("Родитель", СтрокаТаблицы.КлючевойПоказатель);
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Дерево = Форма.РеквизитФормыВЗначение("Дерево" + СтрокаТаблицы.ИмяГруппы);
		КоличествоСтрок = 0;
		Для Каждого СтрокаРезультата Из РезультатЗапроса.Строки Цикл 
			
			СтрокаДерева = Дерево.Строки.Добавить();
			СтрокаДерева.Код = СтрокаРезультата.Код;
			СтрокаДерева.КлючевойПоказатель = СтрокаРезультата.КлючевойПоказатель;
			СтрокаДерева.ЕдиницаИзмерения = СтрокаРезультата.ЕдиницаИзмерения;
			НайденныеСтроки = Объект.ДанныеКПД.НайтиСтроки(Новый Структура("КлючевойПоказатель",СтрокаДерева.КлючевойПоказатель));
			Если НЕ НайденныеСтроки.Количество() Тогда
				СтрокаТЧ = Объект.ДанныеКПД.Добавить();
				СтрокаТЧ.Код = СтрокаДерева.Код;
				СтрокаТЧ.КлючевойПоказатель = СтрокаДерева.КлючевойПоказатель;
				СтрокаТЧ.ЕдиницаИзмерения = СтрокаДерева.ЕдиницаИзмерения;
			Иначе
				ЗаполнитьЗначенияСвойств(СтрокаДерева,НайденныеСтроки[0]);
			КонецЕсли;
			КоличествоСтрок = КоличествоСтрок +1;
			Если СтрокаРезультата.Строки.Количество() Тогда 
				Для Каждого  ВторойУровеньСтрок Из СтрокаРезультата.Строки Цикл
					СтрокаДерева2 = СтрокаДерева.Строки.Добавить();
					СтрокаДерева2.Код = ВторойУровеньСтрок.Код;
					СтрокаДерева2.ЕдиницаИзмерения = ВторойУровеньСтрок.ЕдиницаИзмерения; 
					СтрокаДерева2.КлючевойПоказатель = ВторойУровеньСтрок.КлючевойПоказатель; 
					
					НайденныеСтроки = Объект.ДанныеКПД.НайтиСтроки(Новый Структура("КлючевойПоказатель",СтрокаДерева2.КлючевойПоказатель));
					Если НЕ НайденныеСтроки.Количество() Тогда
						СтрокаТЧ = Объект.ДанныеКПД.Добавить();
						СтрокаТЧ.Код = СтрокаДерева2.Код;
						СтрокаТЧ.КлючевойПоказатель = СтрокаДерева2.КлючевойПоказатель;
						СтрокаТЧ.ЕдиницаИзмерения = СтрокаДерева2.ЕдиницаИзмерения;
					Иначе
						ЗаполнитьЗначенияСвойств(СтрокаДерева2,НайденныеСтроки[0]);
					КонецЕсли;
					
					КоличествоСтрок = КоличествоСтрок +1;
					Если ВторойУровеньСтрок.Строки.Количество() Тогда 
						Для Каждого ТретийУровеньСтрок Из ВторойУровеньСтрок.Строки Цикл 
							КоличествоСтрок = КоличествоСтрок +1;
							СтрокаДерева3 = СтрокаДерева2.Строки.Добавить();
							СтрокаДерева3.Код = ВторойУровеньСтрок.Код;
							СтрокаДерева3.КлючевойПоказатель = ВторойУровеньСтрок.КлючевойПоказатель; 
							СтрокаДерева3.ЕдиницаИзмерения = ВторойУровеньСтрок.ЕдиницаИзмерения; 
							НайденныеСтроки = Объект.ДанныеКПД.НайтиСтроки(Новый Структура("КлючевойПоказатель",СтрокаДерева3.КлючевойПоказатель));
							Если НЕ НайденныеСтроки.Количество() Тогда
								СтрокаТЧ = Объект.ДанныеКПД.Добавить();
								СтрокаТЧ.Код = СтрокаДерева3.Код;
								СтрокаТЧ.КлючевойПоказатель = СтрокаДерева3.КлючевойПоказатель;
								СтрокаТЧ.ЕдиницаИзмерения = СтрокаДерева3.ЕдиницаИзмерения;
							Иначе
								ЗаполнитьЗначенияСвойств(СтрокаДерева3,НайденныеСтроки[0]);
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
					
					КонецЦикла;	
				КонецЕсли;
			
			
		КонецЦикла;
		
		Форма.Элементы["Дерево"+СтрокаТаблицы.ИмяГруппы].Высота = КоличествоСтрок;
		
		Форма.ЗначениеВРеквизитФормы(Дерево,"Дерево" + СтрокаТаблицы.ИмяГруппы);
		
	КонецЦикла;
	
	
КонецПроцедуры  

Процедура ПередЗаписьюНаСервереKPI(Форма,Отказ, ТекущийОбъект, ПараметрыЗаписи)  Экспорт

	Для Каждого СтрокаТаблицы Из Форма.ТаблицаСтраницKPI Цикл 
   		Дерево = Форма.РеквизитФормыВЗначение("Дерево"+СтрокаТаблицы.ИмяГруппы);
		ДеревоВ_ТЧ_KPI(Дерево.Строки,ТекущийОбъект);
	КонецЦикла;

КонецПроцедуры
 


Процедура ДеревоВ_ТЧ_KPI(СтрокиДерева,ТекущийОбъект)

	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		НайденныеСтроки  = ТекущийОбъект.ДанныеКПД.НайтиСтроки(Новый Структура("КлючевойПоказатель",СтрокаДерева.КлючевойПоказатель));
		Для каждого НайденнаяСтрока из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(НайденнаяСтрока,СтрокаДерева);
		КонецЦикла;
		Если СтрокаДерева.Строки.Количество() Тогда
			
			ДеревоВ_ТЧ_KPI(СтрокаДерева.Строки,ТекущийОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры // ДеревоВТЧ()
